app/controllers/api/v1/articles_controller.rb

            def index
                articles = Article.order('created_at DESC');
---
SELECT "articles".* FROM "articles" ORDER BY created_at DESC

            def show
                article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

            def create
                article = Article.new(article_params)

                if article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", nil], ["body", nil], ["created_at", "2023-05-10 21:44:27.084412"], ["updated_at", "2023-05-10 21:44:27.084412"]]

            def destroy
                article = Article.find(params[:id])
                article.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 6]]

            def update
                article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]